while

while문은 특정 조건이 참이라면 계속해서 반복하는 반복문입니다. 

for 문은 특정 숫자를 가지고 숫자의 값을 비교하고, 증감해주면서 반복을 한다면, 

while문은 조건을 확인만 하면서 반복을 합니다. 

때문에, 조건문 내부에서 변화를 직접 주어야 합니다.

우리가 가장 처음 작성했던 0 부터 9 까지 콘솔에 출력을하는 반복문을 while 문으로 구현해보겠습니다.

let i = 0;
while (i < 10) {
  console.log(i);
  i++;
}
while 문을 사용 할 때에는 조건문이 언젠간 false 가 되도록 신경쓰셔야 합니다. 

만약에 언젠간 false 로 전환이 되지 않는다면 반복문이 끝나지 않고 영원히 반복됩니다.

while

while 특정 조건이 참이라면 계속 반복하는 반복문

for문은 특정 숫자를 가지고 숫자의 값 비교, 증감해주면서 반복

while문은 조건을 확인만 하면서 반복

때문에 조건문 내부에서 변화를 직접 줘야 한다.

let i = 0;
while (i <10) {
 console.log(i);
 i++;
}

while 문을 사용할 때에는 조건문이 언젠가 falserk 가 되도록 신경 써야한다.

만약에 false 전환이 되지 않으면 반복문이 끝나지 않고 영원히 반복됨